// @ts-ignore
import { Request, Response } from 'express';

export default {
  'POST /rpc/auth/AuthService.LoginByEmail': (req: Request, res: Response) => {
    res.status(200).send({
      code: 75,
      msg: '况温规起基压生统养直最已等。',
      user_id: 'dDEE9a7D-3d96-355d-b1D3-Dd1c18D8ffB5',
      role_codes: [
        '管海值县展花状很把议院代期。',
        '构交和干从理每流式节方象收学。',
        '心导快动的时南确八这器物主机。',
        '不观程织明五果京记看并你。',
        '结发物打其反但以加运型们习拉打西引。',
        '北社查单道公产身主三更达。',
        '些中出率对关引做具除己飞党美知北公构。',
        '气争变把那适表社质图制石与六非外。',
        '人条关深头众决气且物门即习红型般中。',
        '速各证研况事林后求情速自太引见求算。',
        '毛后声照质较米比志起包转已们结矿。',
        '他几们族建切开革和同格周那。',
        '特或格正火过点五之得住志。',
        '话决想这段分政见根特变改消必理联立广。',
        '务完土由间军定七社号和都和半所。',
        '团音前单特达置外就去对说情动想般写。',
        '火军省件事六多目置于新际半办加入。',
        '建当才千展会和部厂东求电铁东。',
      ],
      token: '安划常共类农果参按住比内积民。',
    });
  },
};
