// @ts-ignore
import { Request, Response } from 'express';

export default {
  'POST /rpc/auth/AuthService.LoginByPhone': (req: Request, res: Response) => {
    res.status(200).send({
      code: 84,
      msg: '流车图生马红离老和习世处向最流条心定。',
      user_id: '92C4BD10-5b7C-bFc6-6FF2-CE8c04768b0c',
      role_codes: [
        '史此改处标改明手去达东白许两叫。',
        '年质物为种是色去解社多队出原不所看。',
        '约少完百与被重志义些里过军委变计表。',
        '政也事方始格且省约场只加为。',
        '自斯复应派体面治党应军进斗从府外五。',
        '器书反本各战点万细己形角办南深人程期。',
        '养成任而想西满该调场条须志术程然。',
        '技院信只看联队北书什强不思边方。',
        '往又对交集除们作便该根与。',
        '育东场究步持行起酸分明且王叫声志省。',
        '主铁任十利三消空开术团设完务。',
        '之可然明存写团列南体两能所千所万传质。',
        '标调要花济专写取见好准争改例统儿常调。',
        '子毛利间她林图开思示半去门。',
        '分条空变据重重济件约算可组没接。',
        '业务始完天用你族理力家义半传料。',
      ],
      token: '际与金为容特局是再角矿发回毛广火。',
    });
  },
};
