// @ts-ignore
import { Request, Response } from 'express';

export default {
  'POST /rpc/auth/AuthService.Login': (req: Request, res: Response) => {
    res.status(200).send({
      code: 100,
      msg: '和米在毛年矿究过布王党声从子所。',
      user_id: 'a0ae867f-D20E-F2fc-ecef-1BB85C2F3DA2',
      role_codes: [
        '也克时们适共三安化回力八。',
        '置太治去等单斯主时其支在备第品。',
        '年计维头发空代斗化前采步头。',
        '当政气步军铁义容求学他白门历民争。',
        '因土委办消引处入千例维米般。',
        '立众半期那任位者思设受处时。',
        '我响采断斯时团花发过回同价求但亲。',
        '压采又商位表油内更完问自治今如素要来。',
        '当全青时光消和己阶见千在者便。',
        '且事做后则米几出界及制步立看构八。',
        '及生联空律府济领切离相组林列。',
        '矿办天何今如非口极矿水不织象备光时。',
        '确育认部传维教林候只局究际江。',
        '张发候开部织以研受即华为。',
        '政价正象却实段圆线金花市好放日。',
        '海红劳老工及精七海给以圆才。',
        '海算数精义每议通看或法程济求适车。',
        '由也料日段走成化得整火群色。',
        '增员上很阶置正争内具向军般更议北家。',
      ],
      token: '建现型风更安用水容车已器计海法热。',
    });
  },
};
