// @ts-ignore
import { Request, Response } from 'express';

export default {
  'POST /rpc/auth/AuthService.LoginByPhone': (req: Request, res: Response) => {
    res.status(200).send({
      code: 64,
      msg: '值步而业海近二写他事且年我每下空。',
      user_id: 'fA9FDe1C-99C6-839C-A35a-f38dCc3C5f26',
      role_codes: [
        '拉支到温头做还等须高史织全。',
        '儿布种支月个又热六院深华反西见。',
        '听完从如文备单等样天程节在住难便。',
        '律求处的七式教比团起务所运斗热历片。',
        '目太东则统即并解张千音强作听主资义。',
        '响必土造新例式从维式或来。',
        '离并国意响性队又马而必等并安由结压。',
        '明即深常又消道论设节年统头史争京带。',
        '容因整持学马广龙两导看车科。',
        '反细五成称花史美装少利产民造究装。',
        '器指须学程清矿天风干需备比党元共。',
        '门心团史热走争报发影委使常。',
        '团派已专立调写主收目多经参所用革已。',
        '这非片清还每米战在线社达。',
        '高市运验学交北界青王里光不统。',
        '极才使斗化资例解领住效转二于。',
        '厂上亲声种做头走革许新例至众所才前。',
        '千至空说带强比龙原文就及共果。',
      ],
      token: '得往反思思多增取还还进江年明。',
    });
  },
};
