// @ts-ignore
import { Request, Response } from 'express';

export default {
  'POST /rpc/auth/AuthService.LoginByPhone': (req: Request, res: Response) => {
    res.status(200).send({
      code: 66,
      msg: '联易国器别所解热众场图理活观思。',
      user_id: 'Fe9CAeeB-B7AB-56c3-BDA6-04dddd2D77cB',
      role_codes: [
        '别历起入结些农层期很造运已查清应年。',
        '图厂往条界打区信其新过劳个东进民。',
        '现常中求再四革往县月任律事。',
        '加区业这府情老界系存且装第。',
        '程队适候世资两可且即须基经。',
        '被政白着率增维议然果所此。',
        '至认叫毛始且术周调想且清革用。',
        '儿图火家常使由做速手地干。',
        '利务门南世使同年持直解看特写求。',
        '保斗想革上情容要线目管运商相同非车。',
        '素所天白京京龙劳学龙三定无层员。',
        '导圆外果教数农此建五非转较现。',
        '在大引想需指者省深可片低农选厂。',
        '转天十会命压看革还同深月自度及教。',
        '育酸华着干取地酸众斯放团转。',
        '节它温究见她东重石可事路万。',
      ],
      token: '为江前价日者快边强认权江次完直。',
    });
  },
};
