// @ts-ignore
import { Request, Response } from 'express';

export default {
  'POST /rpc/auth/AuthService.LoginByEmail': (req: Request, res: Response) => {
    res.status(200).send({
      code: 97,
      msg: '断战资局器学按矿好物越定把连。',
      user_id: '347EA2E5-ced7-E461-edAE-81DF7DcCcd5a',
      role_codes: [
        '难素引门走矿深步农常打委通区。',
        '思同色原走团品前格信收少路这作有。',
        '断林济才只类生们六口来的制。',
        '铁六基眼林命教党张他快深队务。',
        '车平而叫观公图至力大题集它使飞气阶。',
        '分算所义必二部解过心集或除名存。',
        '第说极拉平重干市清以红白如当。',
        '分张手利始还带世九又数素量越空起器去。',
        '领已现算期根么活次到状进如造程至组。',
        '局带专历近县党矿比马没果。',
        '的其算据清性动型出亲收然步。',
        '员有亲去族价文全克只风断及基别员。',
        '族众层半示经必时或支却到走走现群油团。',
        '观志达位什就社后你品根完又究。',
        '时二口作复队史安产了法圆图议义着快。',
        '高很义利生石王何学界但听称。',
      ],
      token: '事所影需基来边况活红过手领。',
    });
  },
};
