// @ts-ignore
import { Request, Response } from 'express';

export default {
  'POST /rpc/auth/AuthService.Login': (req: Request, res: Response) => {
    res.status(200).send({
      code: 70,
      msg: '平约指离图派人有积法条容资具至本率。',
      user_id: 'Bf49c9AD-bdDb-eFEf-9b33-F47618D69333',
      role_codes: [
        '平南那图打政接上史管教实各。',
        '转由转置明状速它验信运该习委院。',
        '京经么委低过国构音前为料海满命六定。',
        '人温道些里开及解规手步候开意府大队。',
        '交济济起红特流带山中太近。',
        '无则党水下接共影收做区政数断看明单将。',
        '金单划争想构四便确要好段太。',
        '打后类则照要我据然命七住严亲一。',
        '选九些命与等即常式没近它织大达除。',
        '市火后个易只带直称众那关太院总条场级。',
        '水体七使金众广天织满特低。',
        '快确提厂际号局本法边通书证青。',
        '它规得便更见打力表基数属它列再金名文。',
        '路养却指铁压便型山求声连状特二文。',
      ],
      token: '计在照产信算装比长北府身组一。',
    });
  },
};
