// @ts-ignore
import { Request, Response } from 'express';

export default {
  'POST /rpc/auth/AuthService.Login': (req: Request, res: Response) => {
    res.status(200).send({
      code: 88,
      msg: '日工复产族任合清水业军之产华候空上说。',
      user_id: '21DfeDd1-b9EB-fdAc-F44f-26bEdfceF17b',
      role_codes: [
        '代质同收织石过证面海不色学知。',
        '查状花林去制毛多小确容已革数。',
        '分收号习将间真安但十复效日文。',
        '问开打里族切界情利直华用战率。',
        '求响管情能知着时族世平干做。',
        '收期把本土开数或院使响大改么家。',
        '思科属那解包争共石县治角标节示日传题。',
        '难改示他最话没农治克不你管。',
        '音委等联查切数五队安当并九打支就划。',
        '别式需始儿史东圆者建非决自自京响处。',
        '走知始难即天于京按题出政太关。',
        '县难事点业劳省万许精单听效空利积离当。',
        '东处从干火非么来于队清五出阶几定。',
        '关须此人清身千车是子候断美山全先工作。',
      ],
      token: '革节又军百土原龙表低目了龙儿何广民。',
    });
  },
};
