// @ts-ignore
import { Request, Response } from 'express';

export default {
  'POST /rpc/auth/ResourceService.RuleType': (req: Request, res: Response) => {
    res.status(200).send({
      code: 93,
      msg: '压车你你际理图特七山走日以。',
      list: [
        '后资九么论发置个全却样间运七义参。',
        '条劳地路与北声军战强万各四标速。',
        '办号农易等边好其规很入斯更。',
        '计主好无会制族本每究革什了办全。',
        '史口片都复其至同改体一头须少。',
        '他最制政离海劳阶因圆即部却此就长。',
        '委土极此声引统军条除料四立酸片。',
        '斗革加响被下体拉整后九学今太。',
        '道书万上值采适金常得光或难议风积机命。',
        '划传光算下积放往开资常交历带。',
        '场并最增学类过你收件定层。',
        '交号热时转自适为处问产复切断才。',
        '好和她一人想变除直声按间运结将土放。',
        '民已效建两名带便斯便该备通经打片布。',
      ],
    });
  },
};
