// @ts-ignore
import { Request, Response } from 'express';

export default {
  'POST /rpc/auth/ResourceService.RuleType': (req: Request, res: Response) => {
    res.status(200).send({
      code: 87,
      msg: '声广于史维场资社这除反身。',
      list: [
        '件温得日向和阶干中多上向意斗何。',
        '决府参子组别动题干度口物想热石看。',
        '务信万许支拉回导治工有满效。',
        '克强只思少大示场接按才不算音育百。',
        '精色林开地型千新然素角目政代。',
        '领地照证需党专书究里会得机多看近。',
        '切门角条特必向派机龙又变亲法我音性。',
        '至称除些干但记军战管系布效。',
        '带织场争近同通个观位平华青于机发。',
        '保效但号千按始战总手精整满取公所。',
        '火可又县传史成青头基拉适军指。',
        '况先低更处思或外别再何手。',
        '克法明层太族毛完成包结写方支儿。',
        '转听北品点级长各身养多满比。',
        '便记连思成证受成引型性心文现社照物引。',
        '身先或布才别间子证认管六导满划近。',
        '公边加常运应先改数细权无时带求半。',
      ],
    });
  },
};
