// @ts-ignore
import { Request, Response } from 'express';

export default {
  'POST /rpc/auth/ResourceService.RuleType': (req: Request, res: Response) => {
    res.status(200).send({
      code: 91,
      msg: '题也应温眼斗至号产离飞西。',
      list: [
        '南采根每亲信离们决斯育下任时号际从。',
        '便却她千习外究重集提需三持期复。',
        '增六斗研交便改包生红济改己由想克。',
        '五不精导口议体值事为越持养色国气难。',
        '团基情克心自大装真你道向思求。',
        '时开生许万斗几价此及构子阶直。',
        '信三温一新必务文家派群地。',
        '完报她月据无圆写影能表己。',
        '解分地说准就理压物火通传路入场。',
        '验化议集会必完二青活照八部复需许放际。',
        '听清物心合想属表其需调同象实题有观。',
        '技论段再七白京计须火容华与。',
        '层离方其月你治容见回式克么照特效象学。',
        '把使合布不文数地县期圆报总干。',
        '快不老住也基该总她作么无增新段不选。',
      ],
    });
  },
};
