// @ts-ignore
import { Request, Response } from 'express';

export default {
  'POST /rpc/auth/UserService.Get': (req: Request, res: Response) => {
    res.status(200).send({
      code: 66,
      msg: '得此很方天铁非标动花眼报具但数建解。',
      item: {
        id: 'df55aBda-5bAD-b6CB-bcF1-1BE51eB2ed3A',
        account: '体维广况件发老体回石地东展。',
        password: 'string(16)',
        nick_name: '示区政比每但集处处积将状社据到话节资。',
        phone: '11212656433',
        email: 'a.iplufxx@ylnyuhioi.ru',
        create_time: '7q&NEvO',
        create_username: '接已产年和还及习农军东品局性。',
        create_user: '更是同做保解样三打争适应段准之思院却。',
        role_code: [
          '则儿管形基料明低题半查体已加。',
          '条正满十先电六育干老织委十三些。',
          '格公身才做们成存属月条带进。',
          '参活史合自使商候率儿近取上断年工个。',
          '细此定基积马低通口每备更马点。',
          '等石性率任道指半现传象美安律维期。',
          '二后易备劳委别联山体段深去上持。',
          '形记能华加即号之料地行列放军律矿何。',
          '期老一体较路党又带毛时路间己学王是。',
          '部极线看族管想历那种造此感。',
          '强参消表气向最七表八很第且员养已往。',
          '飞积圆候决步些二志离么本九记影。',
          '物场示层两五打积山样革产事写。',
          '周带整林导北非花界道毛两。',
          '个具消下手系集声制自存目许。',
          '华之阶当立准定又采当须们约流技不。',
          '时百计细准克住三火米清层老可。',
          '极队农属在相听重太老生走然。',
          '龙火许料土主习酸生内决现南制能二县。',
          '别被下市合酸于且应造需了运京。',
        ],
      },
    });
  },
};
